Autodesk.Revit.DB.TextNode.GetFormattedText
Returns an Autodesk.Revit.DB.FormattedText object that contains text and associated formatting of this TextNode.
Returns:
The object that contains the text and associated formatting of of the text in this text note.
Since:
2017

Autodesk.Revit.DB.TextNode.VerticalAlignment
Indicates default vertical alignment of the text.
Since:
2016

Autodesk.Revit.DB.TextNode.HorizontalAlignment
Indicates default horizontal alignment of the text.
Since:
2016

Autodesk.Revit.DB.TextNode.IsKeptReadable
Indicates text behavior inside a rotated text object.
Remarks:
If the property is True then the text inside the text box gets oriented
so it is readable when looking straight up at the sheet or from its right side;
in other words, the text would never be upside down.
If the value is False, however, the text's orientation strictly follows
the rotation of the text box, which means the text may be upside down when
viewed on screen or printed on a sheet.
Since:
2016

Autodesk.Revit.DB.TextNode.IsTransparent
Indicates whether the text background is transparent or opaque.
Since:
2016

Autodesk.Revit.DB.TextNode.IsUnderlined
Indicates whether the default formatting is set to underlined text.
Since:
2016

Autodesk.Revit.DB.TextNode.IsItalic
Indicates whether the default formatting is set to italic text.
Since:
2016

Autodesk.Revit.DB.TextNode.IsBold
Indicates whether the default formatting is set to bold text.
Since:
2016

Autodesk.Revit.DB.TextNode.TabSize
The size [ft] of the interval between tab stops, in model space.
Since:
2016

Autodesk.Revit.DB.TextNode.FontHeight
Height [ft] of the text font, in model space.
Remarks:
This is the height of the 'M' glyph in the text font.
Since:
2016

Autodesk.Revit.DB.TextNode.Height
Height [ft] of the area of the text content in model space.
Since:
2016

Autodesk.Revit.DB.TextNode.WidthScale
Scale applied to the width of the text.
Since:
2016

Autodesk.Revit.DB.TextNode.Width
Width [ft] of the area of the text content in model space.
Remarks:
Specifies the actual width of the text, that is essentially the width of the longest line, including any spaces.
The value represents the width after the width scale has been applied.
Since:
2016

Autodesk.Revit.DB.TextNode.UpDirection
Direction along the vertical axis of letters of the text object in model space.
Since:
2016

Autodesk.Revit.DB.TextNode.BaseDirection
Direction of the base line of the text object in model space.
Since:
2016

Autodesk.Revit.DB.TextNode.Position
Position of the text in model coordinates.
Remarks:
The relation of the position point with respect
to the text area depends on the text alignment.
For example:
For Left-Top-aligned text the point is at the Left-Top corner of the box.For Center-Bottom aligned text the point is at the Center-Bottom corner of the box.
Since:
2016

Autodesk.Revit.DB.TextNode.Text
The content of the text annotation as a plain string stripped of all formatting.
Remarks:
The text may contain new-lines if there are any in the text annotation.
Since:
2016

Autodesk.Revit.DB.TextNode.FontName
The name of the text font.
Since:
2016

Autodesk.Revit.DB.TextNode.Color
The color of the text.
Since:
2016

Autodesk.Revit.DB.TextNode
This is a class representing a text annotation object in a model-exporting process.
Remarks:
See also: Autodesk::Revit::DB::IModelExportContext::OnText.
Since:
2016